player_songs_dict = {
                    (1,1):['היט מי בייבי'],
                    (1,2):['נערי שובה אלי', 'ברזיל',
                            'לסט כריסטמס'],
                     (1,3):['פני מלאך', 'בליים קנדה'],
                     (2,1):['בייבי שארק', 'סלינו על כתפינו', 'עוף גוזל'],
                    (2,2):['תני לי', 'מעלה מעלה', 'בום פם',
                            'להשתטות לפעמים', 'רוצי שמוליק', 'צוללת צהובה',
                            'ילדה סוכר', 'כמה יוסי', 'הללויה'],
                    (2,3):['וולארה', 'דיוה', 'סבן ניישן ארמי',
                            'היא כל כך יפה', 'נפלת חזק'],
                    (3,1):['תודה'],
                     (3,2):['מתגעגע','שקלים'],
                     (3,3):['יש לי חברה', 'תביא קצת דינרוס'],
                    }

def get_song_lyrics(selected_song, name1, name2):
    song_template_dict = {
        'היט מי בייבי':f'{name1} {name2} בייבי וואן מור טיים!',
        'ברזיל':f'{name2} לה לה לה לה לה לה {name2} לה לה לה לה לה לה {name2} לה לה לה לה לה לה',
        'נערי שובה אלי':f'שחר הפציע, הוא לא הגיע: מתי? מתי תשוב אלי? ו{name1} {name2} עולה עולה ו{name1} {name2} עולה עולה',
        'לסט כריסטמס':f'{name1} {name2} גאון אגדה',
        'פני מלאך':f'{name2} הוא נשק לך והלך! {name2} בחיים שלי כל כך',
        'בליים קנדה':f'{name1} {name2}! {name1} {name2}!',
        'בייבי שארק': f"{name1} {name2} טודודודודודו {name1} {name2} טודודודודודו {name1} {name2} טודודודודודו {name1} {name2}",
        'עוף גוזל':f'{name1} {name2} גאון מלא בשכל',
        'בום פם': f"{name1} {name2} טה נה נה נה נה {name1} {name2} טה נה נה נה נה {name1} {name2} טה נה נה נה נה נה {name2} עולה עולה",
        'סלינו על כתפינו':f'מקצות הארץ באנו הבאנו {name1} {name2}. {name1} {name2}! {name1} {name2} עולה עולה! {name1} {name2}! {name1} {name2} עולה עולה',
        'תני לי':f"{name2} תמיד איתך, בכל דקה, הו {name1} {name2}",
        'מעלה מעלה':f"!!!{name1} {name1} {name2} - כל התקנים והמלגות {name1} {name1} {name2} שירו עוד ועוד",
        'להשתטות לפעמים':f'לא חשוב לאן נלך ולא חשוב מה נעשה, רק שנהיה ביחד זו עם זה. {name1} {name2} עולה עולה {name1} {name2} עולה עולה',
        'רוצי שמוליק':f'{name1} {name2} כפרה ושולחים לך אלף נשיקות',
        'ילדה סוכר':f'{name1} {name2} שכל של גאון ואגדה',
        'כמה יוסי':f'יא גאוווווווווון! {name1} {name2}',
        'הללויה':f'{name1} {name2} הגאון {name1} {name2} יודע.ת המון',
        'צוללת צהובה':f'נה נה נה נה {name2} נשמה {name2} נשמה {name2} נשמה',
        'וולארה':f"{name2} ..... הוווווו ......",
        'דיוה':f"{name1} {name2} {name1} {name2} לגביעעעעעעע",
        'סבן ניישן ארמי':f'{name1} {name2} שכל! {name1} {name2} שכל!',
        'נפלת חזק':f'{name1} {name2} חכמה שכמותה לא נראתה בחיים שלך, משוגע, אז תודה ש {name1} {name2}',
        'היא כל כך יפה':f'{name1} {name2} זה צובט בלב שלך',
        'תודה':f'{name1} {name2} מה שנתת {name1} {name2} שלי כתבת. עולה עולה-הו עולה עולה-הו {name1} {name2} עולה עולה',
        'מתגעגע':f'{name1} {name2} אווווו הוו {name1} {name2} עולה עולה',
        'שקלים':f'{name2} {name2} {name1} {name2} עולה עולה עולה עולה עולה-הו',
        'תביא קצת דינרוס': f"{name1} {name2} אוווו אווווו אוווו אווווו תקן קונה אז {name1} {name2} אוווו אווווו",
        'יש לי חברה':f'{name1} {name2} {name1} {name2} עולה עולה עולה עולה {name1} {name2} {name1} {name2} עולה עולה עולה עולה'
    }

    song_lyrics = song_template_dict.get(selected_song, '')

    return song_lyrics
